#include "ds18b20.h"


/*******************************************************************************
* 函 数 名         : Ds18b20WriteByte
* 函数功能		   : 向18B20写入一个字节
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

void Ds18b20WriteByte(unsigned char dat)
{
	unsigned int i, j;

	for(j=0; j<8; j++)
	{
		DSPort = 0;	     	  //每写入一位数据之前先把总线拉低1us
		i++;
		DSPort = dat & 0x01;  //然后写入一个数据，从最低位开始
		i=6;
		while(i--); //延时68us，持续时间最少60us
		DSPort = 1;	//然后释放总线，至少1us给总线恢复时间才能接着写入第二个数值
		dat >>= 1;
	}
}

/*******************************************************************************
* 函 数 名         : Ds18b20ReadByte
* 函数功能		   : 读取一个字节
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

unsigned char Ds18b20ReadByte()
{
	unsigned char byte, bi;
	unsigned int i, j;	
	for(j=8; j>0; j--)
	{
		DSPort = 0;//先将总线拉低1us
		i++;
		DSPort = 1;//然后释放总线
		i++;
		i++;//延时6us等待数据稳定
		bi = DSPort;	 //读取数据，从最低位开始读取
		/*将byte左移一位，然后与上右移7位后的bi，注意移动之后移掉那位补0。*/
		byte = (byte >> 1) | (bi << 7);						  
		i = 4;		//读取完之后等待48us再接着读取下一个数
		while(i--);
	}				
	return byte;
}


/********************************************************************************
*读取主函数
*
*
*
********************************************************************************/
int Ds18b20Read()
{
	int temp=0;
	float tp;
	unsigned char TMH,TML;
	/************开始初始化*****************************************************/
	unsigned char i=70;
	DSPort=0;//总线拉低480~960us
	while(i--);//每次延时10us
	while(DSPort)	//等待DS18B20拉低总线
	{
		delay_ms(1);
		i++;
		if(i>5)//等待>5MS
		{
			return 0;//初始化失败
		}
	
	}
	//Init finished
	/**********命令传感器进行温度转换*******************************************/
	delay_ms(100);//延迟10ms
	Ds18b20WriteByte(0xcc);		//跳过ROM操作命令		 
	Ds18b20WriteByte(0x44);	    //温度转换命令
	/************再次初始化*****************************************************/
	i=70;
	DSPort=0;//总线拉低480~960us
	while(i--);//每次延时10us
	while(DSPort)	//等待DS18B20拉低总线
	{
		delay_ms(1);
		i++;
		if(i>5)//等待>5MS
		{
			D=!D;
			return 0;//初始化失败
		}
	
	}
	//Init finished
	delay_ms(100);
	Ds18b20WriteByte(0xcc);	 //跳过ROM操作命令
	Ds18b20WriteByte(0xbe);	 //发送读取温度命令
	//Don't delete
	TML = Ds18b20ReadByte();		//读取温度值共16位，先读低字节
	TMH = Ds18b20ReadByte();		//再读高字节
	temp = TMH;
	temp <<= 8;
	temp |= TML;
	//处理temp 
	if(temp< 0)				//当温度值为负数
  	{
		//DisplayData[0] = 0x40; 	  //   -
		//因为读取的温度是实际温度的补码，所以减1，再取反求出原码
		temp=temp-1;
		temp=~temp;
		tp=temp;
		temp=tp*0.0625*100+0.5;	
		//留两个小数点就*100，+0.5是四舍五入，因为C语言浮点数转换为整型的时候把小数点
		//后面的数自动去掉，不管是否大于0.5，而+0.5之后大于0.5的就是进1了，小于0.5的就
		//算加上0.5，还是在小数点后面。
 
  	}
 	else
  	{			
		//DisplayData[0] = 0x00;
		tp=temp;//因为数据处理有小数点所以将温度赋给一个浮点型变量
		//如果温度是正的那么，那么正数的原码就是补码它本身
		temp=tp*0.0625*100+0.5;	
		//留两个小数点就*100，+0.5是四舍五入，因为C语言浮点数转换为整型的时候把小数点
		//后面的数自动去掉，不管是否大于0.5，而+0.5之后大于0.5的就是进1了，小于0.5的就
		//算加上0.5，还是在小数点后面。
	}
	return temp;
}